tg-bot/ШаблонБота/src/Documents/КвестПользователю/КвестПользователю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КвестПользователю</name>
  <registerRecords>InformationRegister.КвестыПользователей</registerRecords>
  <registerRecords>AccumulationRegister.БалансПользователя</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Квест</name>
    <type>
      <types>CatalogRef.Квесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВзятВРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗолото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСеребро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КНачислениюЗолото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КНачислениюСеребро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МодификаторыСтоимости</name>
    <attributes>
      <name>Произошло</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>CatalogRef.БонусыИШтрафы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЗолото</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьСеребро</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

tg-bot/ШаблонБота/src/InformationRegisters/КвестыПользователей/КвестыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КвестыПользователей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияКвеста</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Квест</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

tg-bot/ШаблонБота/src/AccumulationRegisters/БалансПользователя/БалансПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БалансПользователя</name>
  <resources>
    <name>Золото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Серебро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

tg-bot/ШаблонБота/src/Enums/СостоянияКвеста/СостоянияКвеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКвеста</name>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

tg-bot/ШаблонБота/src/Documents/КвестПользователю/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ)
	
	Движения.КвестыПользователей.Записывать = Истина;
	Движения.БалансПользователя.Записывать = Истина;
	
	Если НЕ ЗначениеЗаполнено(ДатаВыдачи) Тогда
		Движения.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВыполнения) Тогда
		ДобавитьДвижениеПоБаллам();
		ДобавитьДвижениеПоСостоянию(Перечисления.СостоянияКвеста.Выполнен, ДатаВыполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВзятВРаботу) Тогда
		ДобавитьДвижениеПоСостоянию(Перечисления.СостоянияКвеста.Выполняется, ДатаВзятВРаботу);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВыдачи) Тогда
		ДобавитьДвижениеПоСостоянию(Перечисления.СостоянияКвеста.Выдан, ДатаВыдачи);
	КонецЕсли;
	

	
КонецПроцедуры

Процедура ДобавитьДвижениеПоБаллам()
	Движение = Движения.БалансПользователя.ДобавитьПриход();
	Движение.Период = ДатаВыполнения;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Золото = КНачислениюЗолото;
	Движение.Серебро = КНачислениюСеребро;
КонецПроцедуры

Процедура ДобавитьДвижениеПоСостоянию(Состояние, Дата)
	Движение = Движения.КвестыПользователей.Добавить();
	Движение.Период = Дата;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Квест = Квест;	
	Движение.Состояние = Состояние;
КонецПроцедуры
